Repository: 84000/data-translation-memory
Catalog: toh154-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Questions of the Nāga King Sāgara

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱ་མཚོ་ཆེན་པོ་ན་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་གནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་འཁོར་གྱི་ཁྱམས་བཀོད་པ་ན།
en: The Blessed One was residing within the ocean in the realm of the nāga king Sāgara.

source: དགེ་སློང་བརྒྱད་སྟོང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་འདུས་པ་མངོན་པར་ཤེས་པ་མངོན་པར་ཤེས་པ་རབ་ཏུ་མང་པོ་དང་།
en: He was in the courtyard of the nāga king Sāgara together with a great monastic saṅgha of eight thousand monks and an assembly of bodhisattva great beings who had assembled from the worlds of the ten directions, a vast number of whom had attained supernatural knowledge.

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ
en: Also present there were Śakra, Brahmā, and the guardians of the world, and many trillions of gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་འདུས་པར་མཁྱེན་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One, knowing the assembly in its entirety, spoke to the nāga king Sāgara,

source: ཀླུའི་བདག་པོ་ཀྱེ་མ་འཇིག་རྟེན་གནས་པ་འདི་ནི་ལས་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བསྐྱོད་ནས་
en: “Lord of nāgas, alas! The state of this world has been shaped by various kinds of karma.

source: སེམས་ཀྱི་དམིགས་པ་སྣ་ཚོགས་ཀྱིས་ལས་རྣམ་པ་སྣ་ཚོགས་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་བྱེད་དེ།
en: The predispositions to various kinds of karma are in turn conditioned by a variety of mental apprehensions.

source: དེ་ཡིས་འགྲོ་བ་ཡང་སྣ་ཚོགས་སུ་གྱུར་ཏོ། །
en: This is also what causes the variety of beings.

source: ཀླུའི་བདག་པོ་འཁོར་འདི་དང་། རྒྱ་མཚོ་ཆེན་པོ་འདི་ན་གཟུགས་རྣམ་པ་སྣ་ཚོགས་ཇི་སྙེད་པ་དང་། གཟུགས་ཐ་མལ་པ་ཇི་སྙེད་སྣང་བ་ལ་ལྟོས།
en: “Lord of nāgas, consider all the various forms of the beings that are present here in this retinue and in this ocean as well—all the diversity of beings that exist here.

source: ཀླུའི་བདག་པོ་འདི་དག་ཐམས་ཅད་ནི་རང་རང་གི་སེམས་དང་། ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ལས་དགེ་བ་དང་མི་དགེ་བ་སྣ་ཚོགས་སུ་བྱས་པས་སྣ་ཚོགས་སུ་གྱུར་པ་དག་གོ། །
en: Lord of nāgas, all these beings are here in such variety due to the variety of their previous engagement in virtue and nonvirtue through activities of mind, body, speech, and intellect.

source: སེམས་ནི་གཟུགས་མེད་པ། བསྟན་དུ་མེད་པ། གཟུང་དུ་མེད་པའོ། །
en: The mind is formless, invisible, and ungraspable.

source: ཀླུའི་བདག་པོ་འདི་ལྟར་ཐམས་ཅད་ནི་བཅོས་མ་སྒྲུབ་པས་གནས་པའི་མཚན་ཉིད་དེ་བདག་པོ་མེད་པ། བདག་གི་མེད་པ། ཡོངས་སུ་འཛིན་པ་མེད་པའོ། །
en: In the same way, lord of nāgas, because all these forms of beings are fabrications, their present characteristics have no owner, no ownership, and are ungraspable.

source: དེ་དག་ནི་ལས་ཇི་ལྟར་བསགས་པས་བསྒྲུབས་པ་སྣ་ཚོགས་སུ་བྱས་པ་དག་སྟེ།
en: Being simply a variety of productions formed by whatever karma has been accumulated,

source: འདི་ལ་བྱེད་པ་པོ་གང་ཡང་མེད་དོ། །
en: they have no creator whatsoever.

source: ཀླུའི་བདག་པོ་འདི་ལྟར་ཆོས་འདི་དག་ཐམས་ཅད་ནི་བསམ་གྱིས་མི་ཁྱབ་པ་སྒྱུ་མའི་མཚན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དོ། །
en: “Lord of nāgas, in this way, all phenomena are inconceivable and have the essential quality of being illusory.

source: ཀླུའི་བདག་པོ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་མཁས་པས་ཆོས་ཐམས་ཅད་བསྒྲུབས་པས་གནས་པའི་མཚན་ཉིད་དུ་ཤེས་ནས་
en: Lord of nāgas, since bodhisattvas are skilled in this regard, they understand that any phenomenon only comes to exist by virtue of being constructed.

source: དགེ་བའི་ལས་མངོན་པར་འདུ་བྱ་བ་དག་མངོན་པར་འདུ་བྱའོ། །
en: Knowing this, they therefore engage in virtue.

source: དེ་དགེ་བའི་ལས་མངོན་པར་འདུ་བྱ་བར་འདུ་བྱེད་ན་བསྒྲུབས་པས་གནས་པའི་མཚན་ཉིད་ཀྱི་ཆོས་རྣམས་ཀྱིས་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་གང་དག་མངོན་པར་འགྲུབ་པ་དེ་དག་མཛེས་ཤིང་བལྟ་ན་སྡུག་ལ་གཟུགས་བཟང་བ་དག་ཏུ་མངོན་པར་འགྲུབ་བོ། །
en: Then, because phenomena are constructed, when such virtuous actions are performed, the resultant aggregates, elements, and sense sources are elegant, lovely to behold, and beautiful.

source: ཀླུའི་བདག་པོ་དེ་བཞིན་གཤེགས་པའི་སྐུ་བསོད་ནམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ལས་སྐྱེས་པ་མཚན་རྣམས་ཀྱིས་ཇི་ལྟར་བརྒྱན་པ་དང་། ཇི་ལྟར་བསྒྲུབས་པ་དང་། དཔལ་གྱིས་ལྷ་དང་མིར་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ནས་མ་ཆགས་པར་བཞུགས་ཏེ
en: “Lord of nāgas, the body of a thus-gone one is born from merits numbering in the trillions. This body, which is adorned with marks, perfectly complete, and splendorous, outshines the worlds of gods and humans and prevails uninterruptedly.

source: གང་ན་བརྒྱ་སྟོང་ཕྲག་བཅུ་ལ་དབང་སྒྱུར་བའི་ཚངས་པ་ཆེན་པོ་འདི་དག་མོག་མོག་པོར་གྱུར་ནས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་ལྟ་ན་ཡང་མིག་ཟི་ཟི་པོར་གྱུར་པ་ལ་ལྟོས།
en: Consider how even the great brahmā gods, who hold dominion over one million worlds, appear faded, and their eyes are blinded, when they look upon the body of a thus-gone one.

source: ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་གི་གཟུགས་དང་། མཚན་དང་། ལུས་དང་། རྒྱན་རྣམས་ལ་ལྟོས།
en: Lord of nāgas, look at the forms, marks, bodies, and adornments of these bodhisattvas.

source: ཀླུའི་བདག་པོ་དེ་དག་ཐམས་ཅད་ནི་དགེ་བའི་ལས་མངོན་པར་འདུ་བྱ་བ་རྣམས་ཀྱིས་མངོན་པར་འདུས་བྱས་པས་བརྒྱན་པར་བསྒྲུབས་པའོ། །
en: Lord of nāgas, they are all beautifully produced by the performance of virtuous actions.

source: ཀླུའི་བདག་པོ་ཁྱོད་ཀྱི་བཀོད་པ་འདི་ཡང་བསོད་ནམས་ཐམས་ཅད་ལས་བྱུང་བའོ། །
en: “Lord of nāgas, this dominion of yours likewise arose from a great amount of merit.

source: ཀླུའི་བདག་པོ་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་འདི་དག་གི་བཀོད་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བསོད་ནམས་ལས་བྱུང་བའོ། །
en: Lord of nāgas, all the dominions of Śakra, Brahmā, and the guardians of the world, and those of the gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, and nonhumans, likewise arise from merit.

source: ཀླུའི་བདག་པོ་རྒྱ་མཚོ་ཆེན་པོ་འདི་ན་གང་དག་ལུས་སྣ་ཚོགས་གཟུགས་མི་སྡུག་ཅིང་དབྱིབས་མ་ལེགས་པ་དང་། དབྱིབས་ལེགས་པ་དང་། ལུས་རགས་ཤིང་ཆེ་བ་རྣམས་དང་། གང་དག་ལུས་ཕྲ་ཞིང་ཆུང་བ་
en: Lord of nāgas, the various bodies within this ocean—whether they are ugly and unshapely, shapely, large, and strong, or small and thin—

source: དེ་དག་ཐམས་ཅད་ཀྱང་རང་རང་གི་སེམས་དང་། ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ལས་དགེ་བ་དང་། མི་དགེ་བས་སྣ་ཚོགས་སུ་གྱུར་པ་དག་གོ། །
en: all those bodies are products of the diversity of virtuous and nonvirtuous actions of mind, body, speech, and intellect that each individual engaged in.

source: ཀླུའི་བདག་པོ་དེ་བས་ན་ལས་བདག་གིར་བྱ་བ་ལས་ཀྱི་བགོ་སྐལ་ལ་སྤྱོད་པ། ལས་ཀྱི་སྐྱེ་གནས་པ། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་རྟོན་པར་བྱའོ་ཞེས་
en: “Lord of nāgas, because of this, it is said that ‘Beings must be confident in the way karma is appropriated and inherited, shapes beings’ birth, and ripens.’

source: ཀླུའི་བདག་པོ་ཁྱེད་ཀྱིས་དེ་ལྟར་སློབས་ཤིག་དང་།
en: “Lord of nāgas, you should train in this way.

source: ལས་བདག་གིར་བྱ་བ་ལས་ཀྱི་བགོ་སྐལ་ལ་སྤྱོད་པ། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་རྟོན་པ་ཁྱེད་དགེ་བའི་ཆོས་མངོན་པར་འདུ་བྱ་བ་ལ་བློ་འཇུག་པར་འགྱུར་རོ། །
en: Being confident in the way karma is appropriated and inherited and the way it ripens, you will become focused on producing virtuous qualities.

source: ལྟ་བ་ཆུད་གསོན་པར་བྱེད་པར་མི་འགྱུར་རོ། །
en: You will not debase your view.

source: ཆད་པ་དང་རྟག་པར་ལྟ་བ་ལ་གནས་པར་མི་འགྱུར་རོ། །
en: You will not give rise to nihilist or eternalist views.

source: ཁྱེད་ཀྱིས་སྦྱིན་པའི་གནས་རྣམས་མགུ་བར་བྱེད་པར་འགྱུར་རོ། །
en: You will please those who are worthy of veneration

source: མགུ་བར་བྱས་ནས་ཀྱང་བསྟི་སྟང་བྱེད་པར་འགྱུར་རོ། །
en: and, having pleased them, you will also show them respect.

source: བསྟི་སྟང་བྱས་པའི་རྒྱུ་ལས་བྱུང་བས་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་བསྟི་སྟང་བྱས་པར་འགྱུར་རོ། །
en: Then, because of that respect, the entire world, including the gods, will show their respect to you.

source: ཀླུའི་བདག་པོ་ཆོས་གཅིག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ངན་འགྲོ་ངན་སོང་མི་ཁོམ་པའི་ལམ་ཐམས་ཅད་ཡང་དག་པར་གཅོད་དོ། །
en: “Lord of nāgas, there is one teaching that severs, for all beings, all the paths that lead to the unfortunate destinies, the lower realms, the unfavorable states.

source: ཆོས་གཅིག་པོ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What is that one teaching?

source: བདག་ཇི་ལྟར་གྱུར་ཅིང་ཉིན་ཞག་རྣམས་འགྲོ་ཞིག་གུ་སྙམ་དུ་དགེ་བའི་ཆོས་རྣམས་ལ་རབ་ཏུ་རྟོག་པའོ། །
en: It is to contemplate virtuous qualities while thinking, ‘However I am now, it will pass just like the days go by.’

source: དེ་དེ་ལྟར་དགེ་བའི་ཆོས་ལ་རབ་ཏུ་རྟོག་པ་མང་བས་མི་དགེ་བའི་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་ཀྱི་གོ་སྐབས་མི་འབྱེད་དོ། །
en: By repeatedly contemplating virtuous qualities in this way, there will be no opportunity for nonvirtuous thoughts and mental states to arise.

source: དེ་མི་དགེ་བའི་ཆོས་སྤངས་ཏེ་དགེ་བའི་ཆོས་དང་ལྡན་པས་བསམ་པ་དག་པའི་སེམས་ཅན་འདི་ལྟ་སྟེ།
en: Having abandoned nonvirtue and being endowed with virtuous qualities in this way,

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། འཕགས་པ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་དང་འགྲོགས་པ་རྙེད་པར་འགྱུར་རོ། །
en: such beings have a pure outlook and they will find company with the buddhas and bodhisattvas, and with the noble hearers and solitary buddhas.

source: ཀླུའི་བདག་པོ། དེ་ལ་དགེ་བའི་ཆོས་རྣམས་གང་ཞེ་ན།
en: “Lord of nāgas, what are those virtuous qualities?

source: དགེ་བའི་ཆོས་རྣམས་ཞེས་བྱ་བ་ནི་ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པའི་རྩ་བ་དང་རྟེན་ཏོ། །
en: The virtuous qualities are the roots and foundations of the excellence of gods and humans.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱི་རྩ་བ་དང་རྟེན་ཏོ། །
en: They are the roots and foundations of the awakening of the hearers and solitary buddhas.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྩ་བ་དང་རྟེན་ཏོ། །
en: They are the roots and foundations of unexcelled and perfect awakening.

source: དེ་ལ་རྩ་བ་དང་རྟེན་གང་ཞེ་ན།
en: “What are those roots and foundations?

source: གང་འདི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་སོ། །
en: They are the paths of the ten virtues.

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དེ་དག་ཀྱང་གང་ཞེ་ན།
en: What are those paths of the ten virtues?

source: འདི་ལྟ་སྟེ། སྲོག་གཅོད་པ་སྤོང་བ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ཚིག་རྩུབ་པོ་དང་། ཚིག་ཀྱལ་པ་དང་། བརྣབ་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བ་སྤོང་བའོ། །
en: They are to forsake the following: killing, stealing, sexual misconduct, lying, slander, harsh words, meaningless talk, covetousness, malevolence, and wrong views.

source: འདི་དག་ནི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཞེས་བྱ་སྟེ།
en: The abandonment of these constitutes the paths of the ten virtues.

source: འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཀྱི་རྩ་བ་དང་རྟེན་ཏོ། །
en: They are the roots and foundations for both mundane and supramundane excellence.

source: ཀླུའི་བདག་པོ་དེ་ལ་སྲོག་གཅོད་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་རབ་ཏུ་ཞི་བར་བྱེད་པའི་ཆོས་བཅུ་འཐོབ་བོ། །
en: “Lord of nāgas, those who have forsaken killing will obtain ten qualities of pacification.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these ten qualities?

source: འདིས་སེམས་ཅན་ཐམས་ཅད་ལ་མི་འཇིགས་པ་བྱིན་པ་ཡིན་ནོ། །
en: They will grant fearlessness to all beings.

source: དེའི་སེམས་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པར་དམིགས་པ་ལ་གནས་པ་ཡིན་ནོ། །
en: They will regard all beings with love.

source: དེའི་ཞེ་སྡང་གི་བག་ཆགས་ཡང་དག་པར་ཆད་པ་ཡིན་ནོ། །
en: They will eliminate the tendency for aggression.

source: དེས་ནད་ཉུང་བར་འགྱུར་བར་སྒྲུབ་པ་ཡོངས་སུ་བཟུང་བ་ཡིན་ནོ། །
en: They will be able to reduce disease.

source: དེས་ཚེ་རིང་བར་འགྱུར་བའི་ས་བོན་བཏབ་པ་ཡིན་ནོ། །
en: They will plant the seed for extending life.

source: དེ་ལ་མི་མ་ཡིན་པ་རྣམས་ཀྱང་སྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦེད་པར་བྱེད་དོ། །
en: They will guard, protect, and shield nonhumans.

source: བདེ་བར་ཉལ་ཞིང་བདེ་བར་སད་པ་དང་། སྡིག་པའི་རྨི་ལམ་མི་མཐོང་བ་ཡིན་ནོ། །
en: They will sleep happily, awaken happily, and not have negative dreams.

source: དེ་ཉལ་བ་ན་ཡང་ལྷ་རྣམས་སྲུང་བར་བྱེད་དོ། །
en: They will have the gods’ protection even when asleep.

source: དེ་ལ་ཤར་གཉེར་བ་མེད་པ་ཡིན་ཏེ།
en: They will be free from animosity and

source: ཤར་གཉེར་བའི་བག་ལ་ཉལ་མེད་པ་ཡིན་ནོ། །
en: the propensity for animosity.

source: ངན་འགྲོ་ཐམས་ཅད་ཀྱིས་མི་འཇིགས་པ་དང་། ཤི་འཕོས་ནས་ཀྱང་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: And they will have no fear of the lower realms and, having died and transmigrated, they will be born among the gods in the joyful celestial realms.

source: ཀླུའི་བདག་པོ་སྲོག་གཅོད་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་རབ་ཏུ་ཞི་བར་བྱེད་པའི་ཆོས་བཅུ་པོ་དེ་དག་འཐོབ་བོ། །
en: Lord of nāgas, those who have forsaken killing will obtain those ten qualities of pacification.

source: སྲོག་གཅོད་པ་སྤངས་པའི་དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན།
en: If they dedicate the roots of virtue of forsaking killing toward unexcelled and perfect awakening, then,

source: དེ་དགེ་བའི་རྩ་བ་དེས་བྱང་ཆུབ་ཐོབ་པ་ན་སེམས་ཀྱི་དབང་གིས་ཚེ་ཚད་མེད་པར་འགྱུར་རོ། །
en: because of those roots of virtue, when they attain awakening the power of their mind will be such that their lifespans become limitless.

source: ཀླུའི་བདག་པོ་མ་བྱིན་པར་ལེན་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ཡིད་བརྟན་པའི་ཆོས་བཅུ་འཐོབ་བོ། །
en: “Lord of nāgas, those who have forsaken stealing will obtain ten qualities of confidence.

source: ལོངས་སྤྱོད་ཆེ་ཞིང་དེའི་ལོངས་སྤྱོད་དེ་དག་རྒྱལ་པོ་དང་། རྐུན་པོ་དང་། མེ་དང་། ཆུ་དང་། མི་མཛའ་བ་དང་། ཉེ་མཚམས་ཀྱིས་མི་འཕྲོགས་པ་ཡིན་ནོ། །
en: They will have great wealth and that wealth will not be taken by kings, thieves, fire, water, enemies, or neighbors.

source: སྐྱེ་བོ་མང་པོའི་ཡིད་དུ་འོང་བས་སྐྱེ་བོ་མང་པོ་དགའ་བ་ཡིན་ནོ། །
en: They will be well liked because they are pleasing to many beings.

source: ཉེ་བའི་ཉོན་མོངས་པ་མེད་པ་ཡིན་ནོ། །
en: They will not have the secondary disturbing emotions.

source: ནོར་འབྲེལ་པ་རྣམས་ལ་ཡིད་བརྟན་དུ་རུང་བ་ཡིན་ནོ། །
en: They will be trusted by those who have wealth.

source: ཕྱོགས་དང་ཕྱོགས་མཚམས་རྣམས་སུ་དེའི་བསྔགས་པ་རྗོད་ཅིང་དེ་ལ་ཕ་རོལ་གྱི་གནོད་པའི་འཇིགས་པ་ཐམས་ཅད་མེད་པ་ཡིན་ནོ། །
en: Their praises will be sung in every direction and they will not fear harm from adversaries anywhere.

source: དེའི་དགེ་བ་བརྗོད་པའི་སྒྲ་དང་ཚིགས་སུ་བཅད་པ་མངོན་པར་འཕགས་པར་འགྱུར་རོ། །
en: The words and verses of the praises of their virtue will be sublime.

source: བག་ཚ་བ་མེད་པར་འཁོར་གྱི་ནང་དུ་འཇུག་སྟེ་ཞུམ་ཞུམ་པོ་མེད་པར་འགྱུར་རོ། །
en: They will not be timid, engaging with those around them without anxiety.

source: ཚེ་དང་། སྟོབས་དང་། ཁ་དོག་དང་། བདེ་བ་དང་། སྤོབས་པ་དང་། ལོངས་སྤྱོད་དང་། ཕྱུག་པ་ཕུན་སུམ་ཚོགས་པ་རབ་ཏུ་འཛིན་པར་འགྱུར་རོ། །
en: They will obtain abundant life, power, beauty, happiness, eloquence, resources, and wealth.

source: དེའི་སེམས་སྦྱིན་པ་ཡང་དག་པར་འགེད་པ་ལ་འགྲོ་བར་འགྱུར་རོ། །
en: They will be inclined toward expansive generosity.

source: ལུས་དང་བྲལ་ནས་ཀྱང་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: And after leaving this body, they will be born among the gods in the joyful celestial realms.

source: ཀླུའི་བདག་པོ་དེ་ལྟར་མ་བྱིན་པར་ལེན་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ཡིད་བརྟན་པའི་ཆོས་བཅུ་པོ་དེ་དག་འཐོབ་བོ། །
en: Lord of nāgas, those who have forsaken stealing they will obtain those ten qualities of confidence.

source: མ་བྱིན་པར་ལེན་པ་སྤངས་པའི་དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན།
en: If they dedicate the roots of virtue of forsaking stealing toward unexcelled and perfect awakening, then,

source: དེ་དགེ་བའི་རྩ་བ་དེས་དེ་བཞིན་གཤེགས་པ་ཉེ་བའི་ཉོན་མོངས་པ་ཅན་མ་ཡིན་པའི་ཡེ་ཤེས་ཅན་དུ་རང་གི་མངོན་པར་ཤེས་པས་
en: because of those roots of virtue, knowing themselves to possess the wisdom of a thus-gone one that is free of secondary disturbing emotions,

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: they will fully awaken to unexcelled and perfect buddhahood.

source: ཀླུའི་བདག་པོ་འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་མཁས་པས་བསྔགས་པའི་ཆོས་བཞི་འཐོབ་བོ། །
en: “Lord of nāgas, those who have forsaken sexual misconduct will obtain four qualities that are praised by the wise.

source: བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these four qualities?

source: དབང་པོ་སྡོམ་པ་དང་།
en: They will have restraint of the senses.

source: རྒོད་པ་ལས་ཡང་དག་པར་འདའ་བ་དང་།
en: They will overcome excitement.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་བསྔགས་པ་དང་། ཆུང་མ་མི་འཕྲོགས་པ་སྟེ།
en: They will be praised by the whole world. And they will not seduce married women.

source: ཀླུའི་བདག་པོ་འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་མཁས་པས་བསྔགས་པའི་ཆོས་བཞི་པོ་དེ་དག་འཐོབ་བོ། །
en: Lord of nāgas, those who have forsaken sexual misconduct will obtain those four qualities that are praised by the wise.

source: འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྤངས་པའི་དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན།
en: If they dedicate the roots of virtue of forsaking sexual misconduct toward unexcelled and perfect awakening, then,

source: དེ་དགེ་བའི་རྩ་བ་དེས་སྐྱེས་བུ་ཆེན་པོའི་མཚན་མདོམས་ཀྱི་སྦ་བ་སྦུབས་སུ་ནུབ་པ་འཐོབ་བོ། །
en: because of those roots of virtue, they will obtain the sheathed genitals, which are a mark of a great being.

source: ཀླུའི་བདག་པོ་བརྫུན་དུ་སྨྲ་བ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ལྷ་དང་མིས་བསྔགས་པའི་ཆོས་བརྒྱད་འཐོབ་བོ། །
en: “Lord of nāgas, those who have forsaken lying will obtain eight qualities that are praised by gods and humans.

source: བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these eight qualities?

source: ཨུད་པ་ལའི་དྲི་འབྱུང་བས་ཁ་ཡོངས་སུ་དག་པ་འཐོབ་པར་འགྱུར་བ་དང་།
en: They will have a clean face with the scent of a blue lotus.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་ཚད་མར་འགྱུར་བ་དང་།
en: They will be held as authoritative by all beings.

source: ལྷ་དང་མི་དགའ་བས་དབང་གཅིག་པོར་འགྱུར་བ་དང་།
en: They will become singularly powerful because they are beloved by gods and humans.

source: དབུགས་འབྱིན་པས་འབྱུང་པོ་རྣམས་དོགས་པ་མེད་པར་འགྱུར་བ་དང་།
en: They will alleviate the fears of spirits due to their assurances.

source: ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པས་ལུས་དང་། ངག་དང་། སེམས་ཡོངས་སུ་དག་པར་འགྱུར་བ་དང་།
en: They will be pure in body, speech, and mind because of their excellent altruism.

source: ཚིག་འཁྲུལ་པ་མེད་པས་མཆོག་ཏུ་དགའ་བ་མང་བར་འགྱུར་བ་དང་།
en: Their happiness will increase because their words are free of confusion.

source: ཚིག་གཟུང་བར་འོས་པས་ངག་ཉན་པར་འགྱུར་བ་དང་།
en: Their voices will be heard because their words are worthy of being remembered. And

source: ཤེས་རབ་ཐོབ་པས་ལྷ་དང་མི་རྣམས་ཀྱི་ནང་དུ་ཁ་ན་མ་ཐོ་བ་མེད་པར་འགྱུར་བ་ཡིན་ཏེ
en: they will be free of wrongdoing among gods and humans because they have obtained insight.

source: ཀླུའི་བདག་པོ་བརྫུན་དུ་སྨྲ་བ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ལྷ་དང་མིས་བསྔགས་པའི་ཆོས་བརྒྱད་པོ་དེ་དག་འཐོབ་བོ། །
en: Lord of nāgas, those who have forsaken lying will obtain those eight qualities that are praised by gods and humans.

source: བརྫུན་དུ་སྨྲ་བ་སྤངས་པའི་དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན།
en: If they dedicate the roots of virtue of forsaking lying toward unexcelled and perfect awakening, then,

source: དེ་དགེ་བའི་རྩ་བ་དེས་བདེན་པའི་རྗེས་སུ་འཇུག་པའི་ཚིག་ཏུ་འགྱུར་རོ། །
en: because of those roots of virtue, their words will be in accord with the truth.

source: ཀླུའི་བདག་པོ་ཕྲ་མའི་ཚིག་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་མི་ཕྱེད་པ་ལྔ་འཐོབ་བོ། །
en: “Lord of nāgas, those who have forsaken slander will obtain five qualities of indivisibility.

source: ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these five qualities?

source: གཞན་གྱི་གནོད་པའི་འཇིགས་པ་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདའ་བས་ལུས་མི་ཕྱེད་པ་འཐོབ་པ་དང་།
en: They will obtain indestructible bodies because they have transcended the terror of being harmed by others.

source: གཞན་དག་གི་ལ་ཆགས་པ་མེད་པས་གཡོག་མི་ཕྱེད་པ་འཐོབ་པ་དང་།
en: They will obtain unswerving retinues because they do not desire that which others own.

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཡིད་ཆེས་པས་དད་པ་མི་ཕྱེད་པ་འཐོབ་པ་དང་།
en: They will obtain unwavering faith because they trust that karma bears fruit.

source: སྒྲུབ་པ་སྙིང་པོར་བྱེད་པས་ཆོས་ལས་མི་ཕྱེད་པ་འཐོབ་པ་དང་།
en: They will be indivisible from the Dharma because they are dedicated to accomplishment. And

source: མི་སླུ་བས་མཛའ་བོ་མི་ཕྱེད་པ་འཐོབ་པ་སྟེ།
en: they will obtain unshakable friendship because they are undeceiving.

source: ཀླུའི་བདག་པོ་ཕྲ་མའི་ཚིག་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་མི་ཕྱེད་པ་ལྔ་པོ་དེ་དག་འཐོབ་བོ། །
en: Lord of nāgas, those who have forsaken slander will obtain those five qualities of indivisibility.

source: ཕྲ་མའི་ཚིག་སྤངས་པའི་དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན།
en: If they dedicate the roots of virtue of forsaking slander toward unexcelled and perfect awakening, then, because of those roots of virtue,

source: དེ་དགེ་བའི་རྩ་བ་དེས་གཡོག་མི་ཕྱེད་པའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་ཏེ།
en: they will become thus-gone ones with an indivisible retinues;

source: བདུད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དེའི་འཁོར་དབྱེ་བར་མི་ནུས་སོ། །
en: not even all the māras and opposing teachers will be able to divide the followers of such thus-gone ones.

source: ཀླུའི་བདག་པོ་ཚིག་རྩུབ་པོ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ངག་གི་ལས་ཡོངས་སུ་དག་པ་བརྒྱད་འཐོབ་བོ། །
en: “Lord of nāgas, those who have forsaken harsh words will obtain eight purities of speech.

source: བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ་
en: What are these eight?

source: ཚིག་རན་པ་དང་། ཕན་པའི་ཚིག་དང་། རིགས་པའི་ཚིག་དང་། འཇམ་པའི་ཚིག་དང་། གཟུང་བའི་ཚིག་དང་། མཉན་པའི་ཚིག་དང་། སྐྱེ་བོ་མང་པོ་དགའ་བའི་ཚིག་དང་། མ་སྨད་པའི་ཚིག་ཡིན་ཏེ
en: They are timely speech, beneficial speech, appropriate speech, gentle speech, comprehensible speech, audible speech, speech that pleases many beings, and dignified speech.

source: ཀླུའི་བདག་པོ་ཚིག་རྩུབ་པོ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ངག་གི་ལས་ཡོངས་སུ་དག་པ་བརྒྱད་པོ་དེ་དག་འཐོབ་བོ། །
en: Lord of nāgas, those who have forsaken harsh words will obtain those eight purities of speech.

source: ཚིག་རྩུབ་པོ་སྤངས་པའི་དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན།
en: If they dedicate the roots of virtue of forsaking harsh words toward unexcelled and perfect awakening, then,

source: དེ་དགེ་བའི་རྩ་བ་དེས་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་སྒྲ་སྐད་བསྒྲགས་པའི་དབྱངས་སུ་འགྱུར་རོ། །
en: because of those roots of virtue, they will become thus-gone ones with voices that resound like Brahmā’s speech.

source: ཀླུའི་བདག་པོ་ཚིག་ཀྱལ་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་གཅིག་ཏུ་ངེས་པ་གསུམ་འཐོབ་བོ། །
en: “Lord of nāgas, those who have forsaken meaningless talk will obtain three complete certainties.

source: གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these three?

source: ཚིག་རན་པས་མཁས་པ་རྣམས་གཅིག་ཏུ་ངེས་པར་དགའ་བ་དང་།
en: Because of their timely words they will certainly please the wise.

source: ལན་ལེགས་པར་ལོན་པས་གཅིག་ཏུ་ངེས་པར་དེའི་བློ་བདེན་པ་ལ་འགྲོ་བ་དང་།
en: Because they answer questions so well, their minds will certainly reach the truth. And

source: བཅོས་མ་མ་ཡིན་པར་མཛའ་བས་གཅིག་ཏུ་ངེས་པར་ལྷ་དང་མིའི་ཆེ་བ་ཉིད་འཐོབ་པ་ཡིན་ཏེ
en: because they are genuine friends, they will certainly obtain the greatness of gods and humans.

source: ཀླུའི་བདག་པོ་ཚིག་ཀྱལ་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་གཅིག་ཏུ་ངེས་པ་གསུམ་པོ་དེ་དག་འཐོབ་བོ། །
en: Lord of nāgas, those who have forsaken meaningless talk will obtain those three complete certainties.

source: ཚིག་ཀྱལ་པ་སྤངས་པའི་དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན།
en: If they dedicate the roots of virtue of forsaking meaningless talk toward unexcelled and perfect awakening,

source: དེ་དགེ་བའི་རྩ་བ་དེས་ཕྱད་པར་ལུང་སྟོན་ཅིང་གཞན་དུ་མི་གསུང་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །
en: then, because of those roots of virtue, they will become thus-gone ones who teach continuously and do not otherwise speak.

source: ཀླུའི་བདག་པོ་བརྣབ་སེམས་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་དབང་པོ་ལྔ་འཐོབ་བོ། །
en: “Lord of nāgas, those who have forsaken covetousness will obtain five strengths.
